import React, { Component } from "react";
import { withRouter } from "react-router-dom";
import { connect } from "react-redux";
import Button from "@material-ui/core/Button";
import Table from "@material-ui/core/Table";
import TableBody from "@material-ui/core/TableBody";
import TableCell from "@material-ui/core/TableCell";
import TableHead from "@material-ui/core/TableHead";
import TableRow from "@material-ui/core/TableRow";
import { setCheckedOutItems } from "../../Redux/Actions";

import cartImage from "../../Images/pic1.jpg";
const mapStateToProps = state => {
  return {
    checkedOutItems: state.checkedOutItems
  };
};

class Connectedinfosur extends Component {
  render() {
  return(
    
    <div><img
              src={cartImage}
              alt={"Logo"}
              style={{ marginLeft: 10 }}

            /><div style={{marginTop: 30,marginBottom: 20,color: "gray",fontSize: 20}}>Ремонт камер відеооспостереження</div>

<p>Будь-який досвідчений підприємець знає, інформація — це запорука успіху в будь-якому перспективному справі. Але трапляються моменти, коли всевидюче «око Гора» ламається і тільки оперативний ремонт відеокамер від компанії Nadzor.ua виправить всі поломки швидко і з гарантією. У кожній окремій галузі відеоспостереження має своїми превосходствами, але головна мета установки – постійний контроль за ситуацією. Оскільки технології розвиваються семимильними кроками ремонт ip камер без спеціального досвіду та належного обладнання може мати небезпечні наслідки. Пам'ятайте - в більшості випадків бажання провести самостійний ремонт відеоспостереження обіцяє необоротними ушкодженнями системи і видаленням всіх даних.</p>

<p>Ремонт системи відеоспостереження — звична справа, адже без таких компактних пристроїв в сучасному світі просто не обійтися. Відеозйомка повинна працювати постійно, саме тому виправлення будь-яких дрібних збоїв вбереже керівництво від покупки нового обладнання. Навіщо зайвий раз витрачати час і гроші на тижневий апгрейд, коли дрібні нюанси можна виправити передчасно.</p>

<div style={{marginTop: 30,marginBottom: 20,color: "gray",fontSize: 20}}>Ознаки поломок</div>
Самими основними ознаками того, що пора звернеться до сервісне обслуговування відеонагляду:

<p>Зникла трансляція звуку</p>
<p>Відключився web-інтерфейс</p>
<p>Відсутній сигнал IP-камери</p>
<p>З'явилися дефекти зображення</p>
<p>Камери перестали функціонувати.</p>
Як показує практика ремонт відеокамер спостереження починається в той момент, коли:

<p>Обладнання вичерпало свій термін експлуатації</p>
<p>Початковий шлюб відеосистем від фірми виробника</p>
<p>Звернення до неперевірену фірму — неякісний монтаж</p>
<p>Агресивна дія (вандалізм, суворі погодні умови).</p>
<p>Терміновий ремонт камер відеоспостереження – Переваги!</p>


При довгостроковому відсутності належного тех. обслуговування ймовірність виникнення поломок істотно підвищується!

<p>Часта проблема – забруднення відеокамер пилом.</p>
<p>Граничний знос блоку живлення відеокамери (від сюди перегрів, збої і короткі замикання). Рішення очевидне – експлуатація була тривалою і тому камера відеоспостереження — ремонт блоку цілком звична справа.</p>
<p>Слабка герметичність вуличних відеокамер (проникнення вологи, корозія, короткі замикання).</p>
<p>Нехай це буде курортне місто або тихий селище в передмісті ремонт камер відеоспостереження – розумне рішення, адже безпека охоронюваного приміщення завжди на першому місці!</p>

</div>  )
}
}
const infofire = withRouter(connect(mapStateToProps)(Connectedinfosur));

export default infofire;
